Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: ?php print "HTML PRE"; $db = ""; $c1 = ocilogon("scott" ,"tiger",$db); $c2 = ocinlogon("scott" ,"tiger",$db); function create_table($conn) {$stmt = ociparse($conn ,"create table scott.hallo (test varchar2(64))"); ociexecute($stmt); echo $conn. "created table\n\n";} function drop_table($conn) {$stmt = ociparse($conn ,"drop table scott.hallo"); ociexecute($stmt); echo $conn." dropped table\n\n";} function insert_data($conn) {$stmt = ociparse($conn ,"insert into scott.hallo values('$conn '_BAR_ _BAR_' '_BAR_ _BAR_ to_char(sysdate ,'DD-MON-YY HH24:MI:SS'))"); ociexecute($stmt,OCI_DEFAULT); echo $conn. "inserted hallo\n\n";} function delete_data($conn) {$stmt = ociparse($conn ,"delete from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn." deleted hallo\n\n";} function commit($conn) {ocicommit($conn); echo $conn. "committed\n\n";} function rollback($conn) {ocirollback($conn); echo $conn." rollback\n\n";} function select_data($conn) {$stmt = ociparse($conn ,"select * from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn ."----selecting\n\n"; while (ocifetch($stmt)) echo $conn. "".ociresult($stmt ,"TEST")." \n\n"; echo $conn ."----done\n\n";} create_table($c1); insert_data($c1); select_data($c1); select_data($c2); rollback($c1); select_data($c1); select_data($c2); insert_data($c2); commit($c2); select_data($c1); delete_data($c1); select_data($c1); select_data($c2); commit($c1); select_data($c1); select_data($c2); drop_table($c1); print "/ PRE / HTML";?
es: ?php print "HTML PRE"; $db = ""; $c1 = ocilogon("scott" ,"tiger",$db); $c2 = ocinlogon("scott" ,"tiger",$db); function create_table($conn) {$stmt = ociparse($conn ,"create table scott.hallo (test varchar2(64))"); ociexecute($stmt); echo $conn. "created table\n\n";} function drop_table($conn) {$stmt = ociparse($conn ,"drop table scott.hallo"); ociexecute($stmt); echo $conn." dropped table\n\n";} function insert_data($conn) {$stmt = ociparse($conn ,"insert into scott.hallo values('$conn '_BAR_ _BAR_' '_BAR_ _BAR_ to_char(sysdate ,'DD-MON-YY HH24:MI:SS'))"); ociexecute($stmt,OCI_DEFAULT); echo $conn. "inserted hallo\n\n";} function delete_data($conn) {$stmt = ociparse($conn ,"delete from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn." deleted hallo\n\n";} function commit($conn) {ocicommit($conn); echo $conn. "commited\n\n";} function rollback($conn) {ocirollback($conn); echo $conn." rollback\n\n";} function select_data($conn) {$stmt = ociparse($conn ,"select * from scott.hallo"); ociexecute($stmt,OCI_DEFAULT); echo $conn ."----selecting\n\n"; while (ocifetch($stmt)) echo $conn. "".ociresult($stmt ,"TEST")." \n\n"; echo $conn ."----done\n\n";} create_table($c1); insert_data($c1); select_data($c1); select_data($c2); rollback($c1); select_data($c1); select_data($c2); insert_data($c2); commit($c2); select_data($c1); delete_data($c1); select_data($c1); select_data($c2); commit($c1); select_data($c1); select_data($c2); drop_table($c1); print "/ PRE / HTML";?

source: OCINumCols() returns the number of columns in a statement.
es: OCINumCols() devuelve el número de columnas en una sentencia

source: OCIParse() parses the query using conn.
es: OCIParse() analiza la query usando conn.

source: It returns the statement identity if the query is valid, FALSE if not.
es: Devuelve el identificador de la sentencia si la consulta es válida, y falso si no lo es.

source: The query can be any valid SQL statement or PL / SQL block.
es: La query puede ser cualquier sentencia SQL válida.

source: OCIPLogon() creates a persistent connection to an Oracle 8 database and logs on.
es: OCIPLogon() crea una conexión persistente con una base de datos Oracle 8.

source: See also OCILogon() and OCINLogon().
es: Vea también OCILogon() y OCINLogon().

source: OCIResult() returns the data for column column in the current row (see OCIFetch()).
es: OCIResult() devuelve el valor de la columna column de la fila actual (vea OCIFetch()).

source: OCIResult() will return everything as strings except for abstract types (ROWIDs, LOBs and FILEs).
es: OCIResult() devolverá todo como una cadena excepto para los tipo de datos abstractos (ROWIDs, LOBs and FILEs).

source: See also OCICommit().
es: OCIRollback() restablece todas las transacciones sin confirmar para la conexión Oracle connection.

source: This function will not tell you the number of rows that a select will return!
es: OCIRowCount() devuelve el número de filas afectadas, por ej. en sentencias de actualización. !Esta función no indicará el número de de filas que devuelve una sentencia SELECT!

source: OCIStatementType() returns one of the following values:
es: OCIStatementType() devuelve uno de los siguiente valores:

source: OCIStatementType() examples
es: Code examples

source: Returns the decimal equivalent of the octal number represented by the octal_string argument.
es: OctDec convierte una cadena octal en un número decimal.

source: The largest number that can be converted is 17777777777 or 2147483647 in decimal.
es: El mayor número que puede ser convertido es 17777777777 o 2147483647 en decimal.

source: See also decoct().
es: Vea también decoct().

source: Without the OnOff parameter, this function returns auto-commit status for connection_id.
es: Sin el parametro OnOff, esta funcion devuelve el estado de auto-entrega para connection_id.

source: TRUE is returned if auto-commit is on, FALSE if it is off or an error occurs.
es: Devuelve TRUE si auto-entrega esta habilitado, y FALSE si no lo esta o ha ocurrido un error.

source: If OnOff is TRUE, auto-commit is enabled, if it is FALSE auto-commit is disabled.
es: Si OnOff es TRUE, auto-entrega esta activado, si es FALSE auto-entrega esta desactivado.

source: Returns TRUE on success, FALSE on failure.
es: Devuelve TRUE cuando se cumple, FALSE cuando falla.

source: By default, auto-commit is on for a connection.
es: Por defecto, auto-entrega es para una conexion.

source: Disabling auto-commit is equivalent with starting a transaction.
es: Desabilitar auto-entrega es como comenzar una transaccion.

source: See also odbc_commit() and odbc_rollback().
es: Ver tambien odbc_commit() y odbc_rollback().

source: (ODBC SQL types affected:
es: (Elementos afectados ODBC SQL:

source: Passthru BINARY data
es: Paso a traves de datos binarios

source: Return as is
es: Devuelve como es

source: Convert to char and return
es: Devuelve convertido en caracter

source: When binary SQL data is converted to character C data, each byte (8 bits) of source data is represented as two ASCII characters.
es: Cuando los datos binarios en SQL son convertidos a datos caracter en C, cada byte (8 bits) de datos fuente es representada como dos caracteres en ASCII.

source: These characters are the ASCII character representation of the number in its hexadecimal form.
es: Esos caracteres son la representacion en ASCII de los numeros en su forma Hexadecimal.

source: For example, a binary 00000001 is converted to "01" and a binary 11111111 is converted to "FF ".
es: Por ejemplo, un 00000001 binario es convertido a "01" y un 11111111 binario es convertido a "FF ".

source: LONGVARBINARY handling
es: Manejo de LONGVARBINARY

source: binmode
es: modo binario

source: result
es: resultado

source: return as is
es: Devuleve como es

source: return as char
es: Devuelve como caracter

source: If odbc_fetch_into() is used, passthru means that an empty string is returned for these columns.
es: Si usamos odbc_fetch_into(), passthru significara que una cadena vacia es devuelta por esas campos.

source: If result_id is 0, the settings apply as default for new results.
es: Si result_id es 0, las definiciones se aplican por defecto para nuevos resultados.

source: Default for longreadlen is 4096 and binmode defaults to ODBC_BINMODE_RETURN.
es: Por defecto, longreadlen es 4096 y el modo binario por defecto es ODBC_BINMODE_RETURN.

source: Handling of binary long columns is also affected by odbc_longreadlen()
es: El manejo de campos binarias largas tambien esta afectado por odbc_longreadlen()

source: odbc_close_all() will close down all connections to database server(s).
es: odbc_close_all() cerrara todas las conexiones a servidor(es) de bases de datos.

source: This function will fail if there are open transactions on a connection.
es: Esta funcion fallara si hay transacciones abiertas sobre esta conexion.

source: This connection will remain open in this case.
es: La conexion quedara abierta en ese caso.

source: odbc_close() will close down the connection to the database server associated with the given connection identifier.
es: odbc_close() cerrara la conexion al servidor de bases datos asociado con el identificador de conexion dado.

source: This function will fail if there are open transactions on this connection.
es: Esta funcion fallara si hay transacciones abiertas sobre esta conexion.

source: The connection will remain open in this case.
es: La conexion quedara abierta en ese caso.

source: All pending transactions on connection_id are committed.
es: Todas las transacciones pendientes sobre connection_id son entregadas.

source: Returns an ODBC connection id or 0 (FALSE) on error.
es: Devuelve una conexion ODBC id, o 0 (FALSE) cuando ocurre un error.

source: The connection id returned by this functions is needed by other ODBC functions.
es: La conexion id devuelta por estas funciones es necesaria para otras funciones ODBC.

source: The optional fourth parameter sets the type of cursor to be used for this connection.
es: El opcional cuarto parametro asigna el tipo de cursor que va a ser usado para esta conexion.

source: This parameter is not normally needed, but can be useful for working around problems with some ODBC drivers.
es: Este parametro normalmente no es necesario, pero puede ser util para trabajar sobre problemas con algunos drivers ODBC.

source: With some ODBC drivers, executing a complex stored procedure may fail with an error similar to: "Cannot open a cursor on a stored procedure that has anything other than a single select statement in it".
es: Con algunos drivers ODBC, si ejecutamos un procedimiento complejo, este puede fallar con un error similar a: "Cannot open a cursor on a stored procedure that has anything other than a single select statement in it".

source: Using SQL_CUR_USE_ODBC may avoid that error.
es: Usando SQL_CUR_USE_ODBC se puede evitar ese error.

source: Also, some drivers don' t support the optional row_number parameter in odbc_fetch_row().
es: Algunos drivers tampoco soportan el parametro row_number en odbc_fetch_row().

source: SQL_CUR_USE_ODBC might help in that case, too.
es: SQL_CUR_USE_ODBC tambien podria ayudar en ese caso.

source: The following constants are defined for cursortype:
es: Las siguientes constantes son definidas por tipos de cursor:

source: For persistent connections see odbc_pconnect().
es: Para conexiones persistentes ver odbc_pconnect().

source: odbc_cursor will return a cursorname for the given result_id.
es: odbc_cursor devolvera un nombre de cursor para el result_id dado.

source: odbc_do() will execute a query on the given connection.
es: odbc_do ejecutara una consulta (query) sobre la conexion dada

source: Returns an ODBC result identifier if the SQL command was executed successfully.
es: Devuelve un indetificador ODBC si el comando SQL fue ejecutado satisfactoriamente.

source: odbc_exec() will send an SQL statement to the database server specified by connection_id.
es: odbc_exec() enviara una declaracion SQL al servidor de bases de datos specificado por connection_id.

source: This parameter must be a valid identifier returned by odbc_connect() or odbc_pconnect().
es: Este parametro debe ser un indetificador valido devuelto por odbc_connect() o odbc_pconnect().

source: See also: odbc_prepare() and odbc_execute() for multiple execution of SQL statements.
es: Ver tambien: odbc_prepare() y odbc_execute() para ejecucion multiple de declaraciones SQL.

source: Parameters in parameter_array will be substituted for placeholders in the prepared statement in order.
es: Ejecuta uan declaracion preparada con odbc_prepare().

source: File reading is not subject to any safe mode or open-basedir restrictions.
es: Introducir el vector arameters_array solo es necesario si realmente tenemos parametros en la declaracion.

source: As of PHP 4.0.6 the rownumber cannot be passed as a constant, but rather as a variable.
es: Devuelve el numero de campos en el resultado; FALSE on error. result_array debe ser pasado por referencia, pero puede ser de cualquier tipo, desde este sera convertido a tipo vector.

source: Example 2. odbc_fetch_into() 4.0.6 example
es: El vector contendra el valor de campo inicial empezando en indice de vector 0.

source: If odbc_fetch_row() was succesful (there was a row), TRUE is returned.
es: Si odbc_fetch_row() fue succesful (there was a row), TRUE is returned.

source: odbc_fetch_row() fetches a row of the data that was returned by odbc_do() / odbc_exec().
es: odbc_fetch_row() busca un registro de datos que fue devuelta por odbc_do() / odbc_exec().

source: After odbc_fetch_row() is called, the fields of that row can be accessed with odbc_result().
es: Despues de que odbc_fetch_row() sea llamado, se puede acceder a los campos de este registro con odbc_result().

source: If row_number is not specified, odbc_fetch_row() will try to fetch the next row in the result set.
es: Si no se especifica row_number, odbc_fetch_row() intentara buscar el siguiente registro en los resultados.

source: Calls to odbc_fetch_row() with and without row_number can be mixed.
es: Lamar a odbc_fetch_row() con o sin row_number puede ser mezclado.

source: To step through the result more than once, you can call odbc_fetch_row() with row_number 1, and then continue doing odbc_fetch_row() without row_number to review the result.
es: Para pasar a traves del resultado mas de una vez, se puede llamar a odbc_fetch_row() con row_number 1, y despues continuar haciendo odbc_fetch_row() sin row_number para revisar el resultado.

source: If a driver doesn 't support fetching rows by number, the row_number parameter is ignored.
es: Si un driver no admitiese busquedas de registros por numero, el parametro row_number seria ignorado.

source: See also: odbc_field_scale() to get the scale of a floating point number.
es: odbc_field_len() devolvera la longitud de un campo referenciado por numero en un identificador ODBC La numeracion de campos comienza en 1.

source: odbc_field_name() will return the name of the field occupying the given column number in the given ODBC result identifier.
es: odbc_field_name() devolvera el nombre del campo almacenado en el numero de campo elegido dentro del identificador ODBC.

source: Field numbering starts at 1.
es: La numeracion de campos comienza en 1.

source: FALSE is returned on error.
es: En caso de error devolveria FALSE.

source: odbc_field_num() will return the number of the column slot that corresponds to the named field in the given ODBC result identifier.
es: odbc_field_num() devolvera el numero de campo que corresponda con el campo llamado en el identificador ODBC.

source: odbc_field_type() will return the SQL type of the field referecend by number in the given ODBC result identifier.
es: odbc_field_type() Devolvera el tipo SQL de un campo referenciado por numero en el identificador ODBC. identifier.

source: odbc_free_result() only needs to be called if you are worried about using too much memory while your script is running.
es: odbc_free_result() solo necesita ser llamado en caso de preocupacion por demasiado uso de memoria cuando se ejecuta un script.

source: All result memory will automatically be freed when the script is finished.
es: Toda la memoria resultante quedara automaticamente liberada cuando el script finalice.

source: But, if you are sure you are not going to need the result data anymore in a script, you may call odbc_free_result(), and the memory associated with result_id will be freed.
es: Pero si es seguro que no se vaya a necesitar la informacion nada mas que en un script, se debera llamar a la funcion odbc_free_result(), y la memoria asociada con result_id sera liberada.

source: If auto-commit is disabled (see odbc_autocommit()) and you call odbc_free_result() before commiting, all pending transactions are rolled back.
es: Si la auto-entrega no esta activada la (ver odbc_autocommit()) y se ejecuta odbc_free_result() antes de la entrega, todo queda pendiente de las transaciones que esten en lista.

source: LONG, LONGVARBINARY) The number of bytes returned to PHP is controled by the parameter length.
es: LONG, LONGVARBINARY) El numero de bytes devueltos para PHP es controlado por el parametro length.

source: If it is set to 0, Long column data is passed thru to the client.
es: Si es asignado a 0, la longitud del campo es pasado al cliente.

source: Handling of LONGVARBINARY columns is also affected by odbc_binmode().
es: El manejo de campos LONGVARBINARY tambien esta afectado por odbc_binmode()

source: odbc_num_fields() will return the number of fields (columns) in an ODBC result.
es: odbc_num_fields() devolvera el numero de campos dentro de un ODBC.

source: This function will return -1 on error.
es: Esta funcion devolvera -1 en caso de error.

source: The argument is a valid result identifier returned by odbc_exec().
es: El argumento es un identificador valido devuelto por odbc_exec().

source: odbc_num_rows() will return the number of rows in an ODBC result.
es: odbc_num_rows() devolvera el numero de registros de un ODBC.

source: For INSERT, UPDATE and DELETE statements odbc_num_rows() returns the number of rows affected.
es: Para declaraciones INSERT, UPDATE y DELETE odbc_num_rows() devolvera el numero de registros afectados.

source: For a SELECT clause this can be the number of rows available.
es: Para una clausula SELECT esta puede ser el numero de registros permitidos.

source: Using odbc_num_rows() to determine the number of rows available after a SELECT will return -1 with many drivers.
es: El uso de odbc_num_rows() para determinar el numero de registros permitidos despues de un SELECT devolvera -1.

source: This function is much like odbc_connect(), except that the connection is not really closed when the script has finished.
es: Esta funcion es odbc_connect(), excepto que la conexion no sea realmente cerrada cuando el script ha finalizado.

source: Future requests for a connection with the same dsn, user, password combination (via odbc_connect() and odbc_pconnect()) can reuse the persistent connection.
es: Las respuestas futuras para una conexion con la misma combinacion dsn, user, password (via odbc_connect() y odbc_pconnect()) puede reusar la conexion permanente.

source: Persistent connections have no effect if PHP is used as a CGI program.
es: Las conexiones permanentes no tienen efecto si PHP es usado como programa CGI.

source: For information about the optional cursor_type parameter see the odbc_connect() function.
es: Para informacion acerca del paramentor opcional cursor_type ver la funcion odbc_connect().

source: For more information on persistent connections, refer to the PHP FAQ.
es: Para mas informacion sobre conexiones permanentes, ir al apartado PHP FAQ.

source: Returns an ODBC result identifier if the SQL command was prepared successfully.
es: Devuelve un identificador ODBC si el comando SQL esta preparado.

source: The result identifier can be used later to execute the statement with odbc_execute().
es: El identificador resultante puede ser usado mas tarde para ejecutar la declaracion con odbc_execute().

source: Returns the number of rows in the result or FALSE on error.
es: En caso de error, como resultado, devuelve FALSE.

source: odbc_result_all() will print all rows from a result identifier produced by odbc_exec().
es: odbc_result_all() Imprimira todos los registros de un identificador prducidoo por odbc_exec().

source: The result is printed in HTML table format.
es: El resultado es impreso en una tabla formato HTML.

source: With the optional string argument format, additional overall table formatting can be done.
es: Con el argumento de cadena opcional format, ademas, todas los formatos de tablas pueden ser realizadas.

source: Returns the contents of the field.
es: Devuelve el contenido de un campo.

source: The first call to odbc_result() The first call to odbc_result() returns the value of the third field in the current record of the query result.
es: La primera sentencia odbc_result() devuelve el valor del tercer campo detro del registro actual de la cola resultante.

source: The second function call to odbc_result() returns the value of the field whose field name is "val "in the current record of the query result.
es: La segunda funcion llama a odbc_result() y devuelve el valor de un campo cuyo nombre es "val "en el registro actual de la cola resultante.

source: An error occurs if a column number parameter for a field is less than one or exceeds the number of columns (or fields) in the current record.
es: Ocurre un error si un numero de columna para un campo es menor que uno o excede el numero de campos en el registro actual.

source: Similarly, an error occurs if a field with a name that is not one of the fieldnames of the table( s) that is(are) being queried.
es: Similarmente, ocurre un error si un campo con un nombre que no sea uno de los nombres de campo de una talba o tablas que sea o sean encoladas.

source: Field indices start from 1.
es: Los indices de campo comienzan en 1.

source: Regarding the way binary or long column data is returned refer to odbc_binmode() and odbc_longreadlen().
es: Recordando el metodo binario de campos con gran informacion, es devuleto con referencia a odbc_binmode () y odbc_longreadlen().

source: Rolls back all pending statements on connection_id.
es: Vuelve a pasar todas las declaraciones pendientes connection_id.

source: This function allows fiddling with the ODBC options for a particular connection or query result.
es: Esta funcion permite buscar las opciones ODBC para una conexion particular o consulta resultante.

source: It was written to help find work arounds to problems in quirky ODBC drivers.
es: Esto esta escrito para trabajar sobre problemas en peculiaries drivers ODBC.

source: You should probably only use this function if you are an ODBC programmer and understand the effects the various options will have.
es: Esta funcion Solo se deberia usar siendo un programador de ODBC y entendiendo los efectos que las opciones tendran.

source: You will certainly need a good ODBC reference to explain all the different options and values that can be used.
es: Debemos tener la certeza de que necesitamos una buena referencia de reference to explicar todas las diferentes opciones y valores que pueden ser usados.

source: Different driver versions support different options.
es: Las diferentes versiones de drivers soportan diferentes opciones.

source: Because the effects may vary depending on the ODBC driver, use of this function in scripts to be made publicly available is strongly discouraged.
es: Ya que los efectos pueden variar dependiendo del driver ODBC, deberiamos usar la function en scripts para ser hecho publico lo que permitira que sea fuertemente desalentado.

source: Also, some ODBC options are not available to this function because they must be set before the connection is established or the query is prepared.
es: Algunas opciones ODBC no estan permitidas para esta funcion porque debe ser configurada antes de que la conexion sea establecida o la consulta este preparada.
